results/ai-agent-continuous/logs/cpu-spike-logs/k6-cpu-spike-run3.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 40 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 04/40 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/40 VUs  0m01.0s/1m00.0s

running (0m02.0s), 08/40 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 08/40 VUs  0m02.0s/1m00.0s

running (0m03.0s), 12/40 VUs, 15 complete and 0 interrupted iterations
default   [   5% ] 12/40 VUs  0m03.0s/1m00.0s

running (0m04.0s), 16/40 VUs, 31 complete and 0 interrupted iterations
default   [   7% ] 16/40 VUs  0m04.0s/1m00.0s

running (0m05.0s), 20/40 VUs, 57 complete and 0 interrupted iterations
default   [   8% ] 20/40 VUs  0m05.0s/1m00.0s

running (0m06.0s), 24/40 VUs, 82 complete and 0 interrupted iterations
default   [  10% ] 24/40 VUs  0m06.0s/1m00.0s

running (0m07.0s), 28/40 VUs, 119 complete and 0 interrupted iterations
default   [  12% ] 28/40 VUs  0m07.0s/1m00.0s

running (0m08.0s), 32/40 VUs, 156 complete and 0 interrupted iterations
default   [  13% ] 32/40 VUs  0m08.0s/1m00.0s

running (0m09.0s), 36/40 VUs, 197 complete and 0 interrupted iterations
default   [  15% ] 36/40 VUs  0m09.0s/1m00.0s

running (0m10.0s), 39/40 VUs, 245 complete and 0 interrupted iterations
default   [  17% ] 39/40 VUs  0m10.0s/1m00.0s

running (0m11.0s), 40/40 VUs, 294 complete and 0 interrupted iterations
default   [  18% ] 40/40 VUs  0m11.0s/1m00.0s

running (0m12.0s), 40/40 VUs, 336 complete and 0 interrupted iterations
default   [  20% ] 40/40 VUs  0m12.0s/1m00.0s

running (0m13.0s), 40/40 VUs, 390 complete and 0 interrupted iterations
default   [  22% ] 40/40 VUs  0m13.0s/1m00.0s

running (0m14.0s), 40/40 VUs, 438 complete and 0 interrupted iterations
default   [  23% ] 40/40 VUs  0m14.0s/1m00.0s

running (0m15.0s), 40/40 VUs, 491 complete and 0 interrupted iterations
default   [  25% ] 40/40 VUs  0m15.0s/1m00.0s

running (0m16.0s), 40/40 VUs, 540 complete and 0 interrupted iterations
default   [  27% ] 40/40 VUs  0m16.0s/1m00.0s

running (0m17.0s), 40/40 VUs, 581 complete and 0 interrupted iterations
default   [  28% ] 40/40 VUs  0m17.0s/1m00.0s

running (0m18.0s), 40/40 VUs, 640 complete and 0 interrupted iterations
default   [  30% ] 40/40 VUs  0m18.0s/1m00.0s

running (0m19.0s), 40/40 VUs, 694 complete and 0 interrupted iterations
default   [  32% ] 40/40 VUs  0m19.0s/1m00.0s

running (0m20.0s), 40/40 VUs, 741 complete and 0 interrupted iterations
default   [  33% ] 40/40 VUs  0m20.0s/1m00.0s

running (0m21.0s), 40/40 VUs, 786 complete and 0 interrupted iterations
default   [  35% ] 40/40 VUs  0m21.0s/1m00.0s

running (0m22.0s), 40/40 VUs, 836 complete and 0 interrupted iterations
default   [  37% ] 40/40 VUs  0m22.0s/1m00.0s

running (0m23.0s), 40/40 VUs, 890 complete and 0 interrupted iterations
default   [  38% ] 40/40 VUs  0m23.0s/1m00.0s

running (0m24.0s), 40/40 VUs, 938 complete and 0 interrupted iterations
default   [  40% ] 40/40 VUs  0m24.0s/1m00.0s

running (0m25.0s), 40/40 VUs, 986 complete and 0 interrupted iterations
default   [  42% ] 40/40 VUs  0m25.0s/1m00.0s

running (0m26.0s), 40/40 VUs, 1035 complete and 0 interrupted iterations
default   [  43% ] 40/40 VUs  0m26.0s/1m00.0s

running (0m27.0s), 40/40 VUs, 1084 complete and 0 interrupted iterations
default   [  45% ] 40/40 VUs  0m27.0s/1m00.0s

running (0m28.0s), 40/40 VUs, 1140 complete and 0 interrupted iterations
default   [  47% ] 40/40 VUs  0m28.0s/1m00.0s

running (0m29.0s), 40/40 VUs, 1193 complete and 0 interrupted iterations
default   [  48% ] 40/40 VUs  0m29.0s/1m00.0s

running (0m30.0s), 40/40 VUs, 1236 complete and 0 interrupted iterations
default   [  50% ] 40/40 VUs  0m30.0s/1m00.0s

running (0m31.0s), 40/40 VUs, 1281 complete and 0 interrupted iterations
default   [  52% ] 40/40 VUs  0m31.0s/1m00.0s

running (0m32.0s), 40/40 VUs, 1338 complete and 0 interrupted iterations
default   [  53% ] 40/40 VUs  0m32.0s/1m00.0s

running (0m33.0s), 40/40 VUs, 1390 complete and 0 interrupted iterations
default   [  55% ] 40/40 VUs  0m33.0s/1m00.0s

running (0m34.0s), 40/40 VUs, 1437 complete and 0 interrupted iterations
default   [  57% ] 40/40 VUs  0m34.0s/1m00.0s

running (0m35.0s), 40/40 VUs, 1482 complete and 0 interrupted iterations
default   [  58% ] 40/40 VUs  0m35.0s/1m00.0s

running (0m36.0s), 40/40 VUs, 1534 complete and 0 interrupted iterations
default   [  60% ] 40/40 VUs  0m36.0s/1m00.0s

running (0m37.0s), 40/40 VUs, 1587 complete and 0 interrupted iterations
default   [  62% ] 40/40 VUs  0m37.0s/1m00.0s

running (0m38.0s), 40/40 VUs, 1637 complete and 0 interrupted iterations
default   [  63% ] 40/40 VUs  0m38.0s/1m00.0s

running (0m39.0s), 40/40 VUs, 1682 complete and 0 interrupted iterations
default   [  65% ] 40/40 VUs  0m39.0s/1m00.0s

running (0m40.0s), 40/40 VUs, 1732 complete and 0 interrupted iterations
default   [  67% ] 40/40 VUs  0m40.0s/1m00.0s

running (0m41.0s), 40/40 VUs, 1787 complete and 0 interrupted iterations
default   [  68% ] 40/40 VUs  0m41.0s/1m00.0s

running (0m42.0s), 40/40 VUs, 1839 complete and 0 interrupted iterations
default   [  70% ] 40/40 VUs  0m42.0s/1m00.0s

running (0m43.0s), 40/40 VUs, 1884 complete and 0 interrupted iterations
default   [  72% ] 40/40 VUs  0m43.0s/1m00.0s

running (0m44.0s), 40/40 VUs, 1932 complete and 0 interrupted iterations
default   [  73% ] 40/40 VUs  0m44.0s/1m00.0s

running (0m45.0s), 40/40 VUs, 1987 complete and 0 interrupted iterations
default   [  75% ] 40/40 VUs  0m45.0s/1m00.0s

running (0m46.0s), 40/40 VUs, 2043 complete and 0 interrupted iterations
default   [  77% ] 40/40 VUs  0m46.0s/1m00.0s

running (0m47.0s), 40/40 VUs, 2087 complete and 0 interrupted iterations
default   [  78% ] 40/40 VUs  0m47.0s/1m00.0s

running (0m48.0s), 40/40 VUs, 2132 complete and 0 interrupted iterations
default   [  80% ] 40/40 VUs  0m48.0s/1m00.0s

running (0m49.0s), 40/40 VUs, 2195 complete and 0 interrupted iterations
default   [  82% ] 40/40 VUs  0m49.0s/1m00.0s

running (0m50.0s), 40/40 VUs, 2245 complete and 0 interrupted iterations
default   [  83% ] 40/40 VUs  0m50.0s/1m00.0s

running (0m51.0s), 38/40 VUs, 2293 complete and 0 interrupted iterations
default   [  85% ] 38/40 VUs  0m51.0s/1m00.0s

running (0m52.0s), 34/40 VUs, 2336 complete and 0 interrupted iterations
default   [  87% ] 34/40 VUs  0m52.0s/1m00.0s

running (0m53.0s), 29/40 VUs, 2390 complete and 0 interrupted iterations
default   [  88% ] 29/40 VUs  0m53.0s/1m00.0s

running (0m54.0s), 26/40 VUs, 2430 complete and 0 interrupted iterations
default   [  90% ] 26/40 VUs  0m54.0s/1m00.0s

running (0m55.0s), 21/40 VUs, 2467 complete and 0 interrupted iterations
default   [  92% ] 21/40 VUs  0m55.0s/1m00.0s

running (0m56.0s), 18/40 VUs, 2500 complete and 0 interrupted iterations
default   [  93% ] 18/40 VUs  0m56.0s/1m00.0s

running (0m57.0s), 14/40 VUs, 2524 complete and 0 interrupted iterations
default   [  95% ] 14/40 VUs  0m57.0s/1m00.0s

running (0m58.0s), 10/40 VUs, 2546 complete and 0 interrupted iterations
default   [  97% ] 10/40 VUs  0m58.0s/1m00.0s

running (0m59.0s), 07/40 VUs, 2558 complete and 0 interrupted iterations
default   [  98% ] 07/40 VUs  0m59.0s/1m00.0s

running (1m00.0s), 01/40 VUs, 2567 complete and 0 interrupted iterations
default   [ 100% ] 01/40 VUs  1m00.0s/1m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 7704   127.016392/s
    checks_succeeded...: 66.66% 5136 out of 7704
    checks_failed......: 33.33% 2568 out of 7704

    ✓ Homepage loaded
    ✓ Added to cart
    ✗ Checkout successful
      ↳  0% — ✓ 0 / ✗ 2568

    HTTP
    http_req_duration..............: avg=183.3ms  min=143.07ms med=178.93ms max=1.07s p(90)=218.6ms  p(95)=228.03ms
      { expected_response:true }...: avg=184.79ms min=143.07ms med=178.17ms max=1.07s p(90)=222.38ms p(95)=231.17ms
    http_req_failed................: 25.00% 2568 out of 10272
    http_reqs......................: 10272  169.355189/s

    EXECUTION
    iteration_duration.............: avg=786.26ms min=652.93ms med=794ms    max=1.88s p(90)=840.97ms p(95)=869.37ms
    iterations.....................: 2568   42.338797/s
    vus............................: 1      min=1             max=40
    vus_max........................: 40     min=40            max=40

    NETWORK
    data_received..................: 82 MB  1.4 MB/s
    data_sent......................: 2.6 MB 43 kB/s



running (1m00.7s), 00/40 VUs, 2568 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/40 VUs  1m0s